#### BuiltInFailures.ImportFailures Members

---

|  |
| --- |
| BuiltInFailures ImportFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ImportFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ATFContainedUnsupportedGeometricData | The original model contains unsupported geometric data such as curves or points. |
| Public property Static member | ATFNonUniformScalingTransform | The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted. |
| Public property Static member | BadFaceFoundInDwg | One or more hatch regions were found in the imported file with unconnected boundaries. These hatch regions will be ignored. |
| Public property Static member | CannotChangeImportSymbol | Can't change an imported or linked element's symbol type. |
| Public property Static member | CannotExplodeElement | Can't explode the imported object. |
| Public property Static member | CannotImportFile | Can't import file. |
| Public property Static member | FailedToSetWorkplane | Could not set Work Plane of [Import].\n\nPlease use the Work Plane tool to set a Work Plane for this view. |
| Public property Static member | IFCCantUpdateLinkedFile | The cached version of this IFC file is already loaded into another document in this session, and can't be updated. To update the IFC file, please close all other documents containing the link, and then update. |
| Public property Static member | IFCGenericImportWarning | The following problems were encountered in the IFC file: [Description] |
| Public property Static member | IFCGenericRevitImportWarning | Revit had the following problems importing the IFC file: [Description] |
| Public property Static member | ImportedModelIsEmpty | Imported model is empty. |
| Public property Static member | ImportModelOutOfRange | The imported model is out of range. |
| Public property Static member | ImportModelTooLarge | The imported model is too large. |
| Public property Static member | ImportScaleTooLarge | This scale factor would make the imported object too large. Reverting to the previous scale factor. |
| Public property Static member | ImportSymbolBaseLevelInvalid | An import instance has become invalid. The host work plane of the import can no longer be used. Click "Rehost" to maintain the position of the import and rehost its work plane to the lowest level. |
| Public property Static member | ImportTooFarAway | Imported objects located a large distance from the model might not display properly. The 'Center-to-Center' option will be used. |
| Public property Static member | ImportTooManyElmentsToExplode | Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded. |
| Public property Static member | LostAcisObjectsOnImport | Some ACIS objects could not be imported. To import them, use AutoCAD to convert them into polymesh objects and reimport. |
| Public property Static member | SomeObjectsNotExploded | Import contained some 3D data or points which can't be exploded. |
| Public property Static member | TextNotImported | Text is only imported if the "Current View Only" option is selected. To see the text in the original file, import again with this check box selected in the Import Dialog. |
| Public property Static member | TooManyPickFaces | Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly. Decrease the complexity of the file or try importing only selected layers to resolve. |
| Public property Static member | WorksetCreatedForLinkWarning | Newly created link types and instances were placed in new workset [workset name] |

# See Also

BuiltInFailures ImportFailures Class

Autodesk.Revit.DB Namespace